---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidSketchPath3d
source: html/fafdd4db-054c-40d4-a697-2e001bd9082f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidSketchPath3d Property

Sketch is invalid.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidSketchPath3d { get; }
```